Autodesk.Revit.DB.Architecture.StairsRunType.RiserToTreadConnect
The connection of the riser to tread in relation to each other.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The run type has no riser so the data being set is not applicable.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsRunType.RiserProfile
The id of the profile of the risers.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The profile is neither a valid element id nor invalidElementId.
-or-
When setting this property: The profile is not a valid riser profile symbol.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The run type has no riser so the data being set is not applicable.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsRunType.RiserThickness
The thickness of the risers.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for length must be greater than 0 and no more than 30000 feet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The run type has no riser so the data being set is not applicable.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsRunType.IsSlanted
True if risers will be slanted, false if they will be straight.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsRunType.TreadNosingPosition
Represents on which edges of the nosing to apply the nosing profile.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The run type has no tread so the data being set is not applicable.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsRunType.TreadProfile
The id of the profile of the treads.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The profile is neither a valid element id nor invalidElementId.
-or-
When setting this property: The profile is not a valid tread profile symbol.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The run type has no tread so the data being set is not applicable.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsRunType.NosingProfile
The id of the nosing profile of the treads.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The profile is neither a valid element id nor invalidElementId.
-or-
When setting this property: The profile is not a valid nosing profile symbol.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The run type has no tread so the data being set is not applicable.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsRunType.NosingLength
The amount of the tread depth that overhangs the next tread.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for length must be between 0 and 30000 feet.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsRunType.TreadThickness
The thickness of the treads.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for thickness must be greater than 0 and no more than 30000 feet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The run type has no tread so the data being set is not applicable.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsRunType.MaterialId
The material of the stairs run, only available for monolithic stairs run.
The id of the material of the stairs run, invalid ElementId if the stairs run is not monolithic.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The materialId is not a valid material element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The stairs run type is not a monolithic type so the data being set is not applicable.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsRunType.UndersideSurfaceStyle
The underside surface style of the stairs run, only available for monolithic stairs run.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The stairs run type is not a monolithic type so the data being set is not applicable.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsRunType.TotalDepth
The total depth of the stairs run, only available for monolithic stairs run.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsRunType.StructuralDepth
The structural depth of the stairs run, only available for monolithic stairs run.
The structural depth of the stairs run, 0.0 if the stairs run is not monolithic.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for structuralDepth must be between 0 and 30000 feet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The stairs run type is not a monolithic type so the data being set is not applicable.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsRunType.HasRisers
True if the stairs run will include risers on steps, false otherwise.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsRunType.HasTreads
True if the stairs run will include treads on steps, false otherwise.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsRunType.IsMonolithic
True if the stairs run is monolithic, false otherwise.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsRunType
A stairs run type object that is used in the generation of stairs run.
Since:
2013